depot/app/controllers/products_controller.rb

INSERT INTO `products` (`price`, `created_at`, `title`, `image_url`, `updated_at`, `description`) VALUES(NULL, '2009-07-01 16:39:40', 'stella', '', '2009-07-01 16:39:40', 'maria')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `updated_at` = '2009-07-01 17:24:17', `title` = 'Pragmatic Unit Testing (C#)', `description` = 'Pragamatic programmers use feedback to drive their development and ...' WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])