depot/app/controllers/store_controller.rb

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2009-07-02 18:49:31', 1, 1, 1, 20, '2009-07-02 18:49:31')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('s', 's', '2009-07-02 18:49:31', '2009-07-02 18:49:31', 'cc', 'stella@hot.com')