app/controllers/restaurants_controller.rb

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 4)
---
  def edit
   @restaurants = Restaurant.find(params[:id])

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 2)
---
    def show
    @restaurants = Restaurant.find(params[:id])

INSERT INTO `restaurants` (`name`, `address`, `created_at`, `updated_at`) VALUES('stella', 'aaaaaaaaaaa', '2009-07-04 15:48:07', '2009-07-04 15:48:07')
---
def create
  #  @restaurant = @user.restaurant.create(params[:restaurant])
  #@restaurants = Restaurant.new(params[:restaurant])
  #render :text => @restaurant.name
 @user = current_user
 @restaurant = Restaurant.new(params[:restaurant])
 @restaurants = Restaurant.create("name" =>@restaurant.name, "address" => @restaurant.address, "user_id"=>@user.id)
  respond_to do |format|
    if @restaurants.save

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 4)
UPDATE `restaurants` SET `updated_at` = '2009-07-04 15:54:02', `name` = 'ffffaaaa' WHERE `id` = 4
---
    def update
    @restaurants= Restaurant.find(params[:id])
  if Restaurant.find(params[:id]).user_id == current_user.id
    respond_to do |format|
      if @restaurants.update_attributes(params[:restaurant])

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 2)
DELETE FROM `restaurants` WHERE `id` = 2
---
     def destroy
    @restaurants = Restaurant.find(params[:id])
    @restaurants.destroy